package com.lauzy.freedom.data.entity;

/**
 * Desc : 百度音乐
 * Author : Lauzy
 * Date : 2018/3/28
 * Blog : http://www.jianshu.com/u/e76853f863a9
 * Email : freedompaladin@gmail.com
 */
public class BaiduLrcEntity {

    /**
     * title : 海阔天空
     * lrcContent : [00:00.33]海阔天空
     [00:02.87]作词：黄家驹  作曲：黄家驹
     [00:04.61]演唱：Beyond
     [00:06.51]
     [00:18.58]今天我 寒夜里看雪飘过
     [00:25.05]怀着冷却了的心窝漂远方
     [00:30.99]风雨里追赶 雾里分不清影踪
     [00:37.15]天空海阔你与我 可会变 (谁没在变)
     [00:43.86]
     [00:44.19]多少次 迎着冷眼与嘲笑
     [00:49.96]从没有放弃过心中的理想
     [00:55.94]一刹那恍惚 若有所失的感觉
     [01:02.06]不知不觉已变淡 心里爱 (谁明白我)
     [01:08.66]
     [01:08.93]原谅我这一生不羁放纵爱自由
     [01:15.88]也会怕有一天会跌倒
     [01:21.99]背弃了理想 谁人都可以
     [01:28.37]哪会怕有一天只你共我
     [01:34.01]
     [01:42.87]今天我 寒夜里看雪飘过
     [01:49.28]怀着冷却了的心窝漂远方
     [01:55.10]风雨里追赶 雾里分不清影踪
     [02:01.46]天空海阔你与我 可会变 (谁没在变)
     [02:08.17]
     [02:08.39]原谅我这一生不羁放纵爱自由
     [02:15.26]也会怕有一天会跌倒
     [02:21.41]背弃了理想 谁人都可以
     [02:27.56]哪会怕有一天只你共我
     [02:33.38]
     [03:08.48]仍然自由自我 永远高唱我歌
     [03:15.16]走遍千里
     [03:19.41]
     [03:19.99]原谅我这一生不羁放纵爱自由
     [03:26.78]也会怕有一天会跌倒
     [03:33.05]背弃了理想 谁人都可以
     [03:38.88]哪会怕有一天只你共我
     [03:45.72]背弃了理想 谁人都可以
     [03:51.71]哪会怕有一天只你共我
     [03:57.38]
     [03:57.88]原谅我这一生不羁放纵爱自由
     [04:04.23]也会怕有一天会跌倒
     [04:10.52]背弃了理想 谁人都可以
     [04:16.63]哪会怕有一天只你共我
     [04:22.80]
     */

    public String title;
    public String lrcContent;

}
